/**********************************************************************************************************************
*                                        (c) COPYRIGHT by AO NPK Pelengator.                                             *
*                                               All rights reserved.                                                  *
***********************************************************************************************************************
* Module      : bky_arm_init.h
* Description :
* Author      : Konstantin Shiluaev
******************************************************************************
******************************************************************************
* Module's Description Record:
* ============================
* $State: Debug$
* $Revision: 0.0.0 $
* $Date: 2015/01/14 10:40:51 $
******************************************************************************/
#ifndef __TIS10_AS_INIT_H
#define __TIS10_AS_INIT_H

#ifdef __cplusplus
extern "C" {
#endif


//Общая ициализация CPU 1986ВЕ91Т
   
//Тактовая Частота RISC Ядра	
 //   #define RISC_DSP_8MHz   1
 //     #define RISC_DSP_24MHZ  1
 //   #define RISC_DSP_96MHz  1

/*Определение Системного Таймера*/
//Сколько разрядов отводим под системный таймер для совместимости с DSP ядром вводим на всякий случай 16 разрядный таймер.
//  #define SYSTIMER_24_BIT                  1
//#define SYSTIMER_16_BIT                  1
 
	
	
	//Тип Системного Таймер
  //#define SYSTIMER_MICROSECOND           1   //Микросекунды
  //#define SYSTIMER_MILLISECOND           1   //Миллисекунды
  //  #define SYSTIMER_SECOND                1   //Секунды
 




//////Прототипы Функции Инициализации

//Стартовая функция инициализации.
  void    Init_ARM(void);


//Другие функции
#ifdef __cplusplus
}
#endif










#endif /*__SYSTEM_MDR32F9Qx_H */

